{
  "quests": [
    {
      "id": "recognise_essence_observe",
      "category": "Recognise",
      "type": "daily",
      "name": "Essence Voice",
      "description": "Where did you show up as your essence voice in your work today",
      "points": 5,
      "inputType": "text",
      "placeholder": "What was the situation? What were you doing?",
      "learnMore": "Tracking when your essence shows up helps you identify how aligned your work is with your essence.\n\nYou're training your awareness so you can show-up from this place more often."
    },
    {
      "id": "recognise_protective_observe",
      "category": "Recognise",
      "type": "daily",
      "name": "Protective Voice",
      "description": "Where did your protective voice emerge in your work today?",
      "points": 5,
      "inputType": "text",
      "placeholder": "What was the situation? What caused it to arise?",
      "learnMore": "Your protective voice is a coping mechanism you developed to keep yourself safe from rejection, failure, or pain.\n\nRecognising when it activates is the first step to changing how we show up in the future."
    },
    {
      "id": "recognise_positive_frequency",
      "category": "Recognise",
      "type": "daily",
      "name": "Positive Frequency",
      "description": "What's a moment where you were challenged in your work today but reacted from a place of love?",
      "points": 3,
      "inputType": "text",
      "placeholder": "What was the situation?",
      "learnMore": "A love response is anything above 'courage' on the emotional frequency scale.\n\nIt includes:\nWillingness: 'Expressesing feelings without blame'.\nAcceptance: 'Making decisions from clarity, not emotion'.\nPeace: 'Seeing innocence in others, even in conflict'.\n\nThis is important because we attract what we are. If we find ourselves responding from anger throughout the day we will attract more anger. If we show up from these higher states we will attract more of them.\n\nTracking these moments builds awareness and accountability."
    },
    {
      "id": "recognise_negative_frequency",
      "category": "Recognise",
      "type": "daily",
      "name": "Negative Frequency",
      "description": "What's a moment you were challenged in your work today and reacted from a place of fear?",
      "points": 3,
      "inputType": "text",
      "placeholder": "What was the situation? What caused you to be triggered?",
      "learnMore": "A fear response is anything below 'courage' on the emotional frequency scale.\n\nIt includes Anger: 'Blaming or pointing out what others did wrong'.\nFear: 'Hesitating or avoiding taking action'.\nShame: 'Going quiet / withdrawing emotionally or physically'.\n\nThis is important because we attract more of what we are. If we show up from fear we limit our growth and opportunities that align with what we love.\n\nTracking these moments builds awareness about what's causing us to react from fear and build accountability to show up from love in the future."
    },
    {
      "id": "recognise_flow_update",
      "category": "Recognise",
      "type": "daily",
      "name": "Daily Flow Update",
      "description": "How did things flow internally and externally for you today, what direction did you flow?",
      "points": 4,
      "inputType": "text",
      "placeholder": "What happened? What direction did you flow?",
      "learnMore": "Internal flow = excitement or tired.\n\nDoes the thought of the action excite you or tire you?\n\nExternal flow = Ease or resistance.\n\nWhen you took action did your intentions came to life as expected and did serendipity's occur? This is Ease.\n\nOr did it not go as expected and did you face unexpected challenges? This is resistance.\n\nNorth = Action excited you and it flowed with ease. This is a signal for continuing.\n\nEast = Action excited you but you faced resistance. This is a signal that a pivot is required.\n\nSouth = Action felt tiring and you faced resistance. This is a signal that you need to rest and / or stop.\n\nWest = Action felt tiring but it led to a new opportunity dropping in. This is a single to potentially explore a new opportunity."
    },
      {
      "id": "recognise_archetype_quiz",
      "category": "Recognise",
      "type": "weekly",
      "name": "Identify Your Archetypes",
      "description": "Which essence and protective voices did you most identify with?",
      "points": 7,
      "inputType": "text",
      "placeholder": "Share what essence and protective voice you identified"
    },
    {
      "id": "recognise_nervous_system",
      "category": "Recognise",
      "type": "weekly",
      "name": "Map The Boundaries Of Your Nervous System",
      "description": "Identify how much money your nervous system feels safe earning before it self-sabotages",
      "points": 25,
      "inputType": "flow",
      "flow_id": "nervous_system",
      "flow_route": "/nervous-system",
      "learnMore": "Your nervous system has invisible boundaries around money, visibility, and success.\n\nWhen you approach these edges, your body creates resistance through self-sabotage, procrastination, or fear.\n\nThis flow uses sway testing (a muscle-testing practice) to identify exactly where those boundaries are empowering you to consciously expand them.\n\nThe flow takes about 10 minutes and since you'll be sway-testing it's recommended you do it at home."
    },
    {
      "id": "recognise_healing_compass",
      "category": "Recognise",
      "type": "weekly",
      "name": "Healing Compass",
      "description": "Identify the wound/s causing your Protective Voice to protect you",
      "points": 20,
      "inputType": "flow",
      "flow_id": "healing_compass",
      "flow_route": "/healing-compass",
      "learnMore": "The Healing Compass is a reflective process that helps you trace your protective patterns back to their origin.\n\nYour protective voice developed as a survival mechanism—understanding the original wound allows you to heal it at the root, rather than just managing symptoms.\n\nThis process typically takes 10-15 minutes and will help you gain clarity on why certain patterns keep showing up in your life and what you need to heal to stop them."
    },
    {
      "id": "recognise_ikigai",
      "category": "Recognise",
      "type": "weekly",
      "name": "Nikigai - Flow Formula",
      "description": "The Ikigai process modernised to identify business opportunities",
      "points": 25,
      "inputType": "flow",
      "flow_id": "nikigai",
      "flow_route": "/nikigai",
      "status": "coming_soon",
      "learnMore": "Ikigai is a Japanese concept meaning 'reason for being.' It sits at the intersection of what you love, what you're good at, what the world needs, and what you can be paid for.\n\nThis modernised version helps you identify tangible business opportunities aligned with your passions, experiences and skills. See it as your Flow Formula.\n\nTakes 15-20 minutes."
    },
    {
      "id": "recognise_define_success",
      "category": "Recognise",
      "type": "weekly",
      "name": "Define Success",
      "description": "What does success mean to you? What's your North Star? How will you know you're 'successful'?",
      "points": 15,
      "inputType": "text",
      "placeholder": "What does success mean to you?",
      "learnMore": "Most people chase inherited definitions of success—money, status, titles—only to feel empty when they achieve them.\n\nDefining success on your own terms is essential for building a life you actually want.\n\nGet specific: what does success feel like, look like, and allow you to do? This becomes your compass for decision-making."
    },
    {
      "id": "recognise_nonfiction_content",
      "category": "Recognise",
      "type": "weekly",
      "name": "Identify Your Curiosities",
      "description": "What was the topic of a podcast, book, or learning that you absolutely loved this week?",
      "points": 15,
      "inputType": "text",
      "placeholder": "The more specific the topic the better",
        "learnMore": "Your curiosities are breadcrumbs leading to what your essence is passionate about and the impact it wants to make in the world.\n\nThe topics you're excited to learn about reveal what you're meant to share with the world.\n\nMost people dismiss their interests as 'just hobbies,' but tracking them over time reveals patterns that point to your unique genius and potential business opportunities."
    },
    {
      "id": "release_daily_challenge",
      "category": "Release",
      "type": "daily",
      "name": "Daily Release Challenge",
      "description": "Check the group chat to see the daily release challenge for the day.",
      "points": 7,
      "inputType": "text",
      "placeholder": "What came up for you in this process today?"
    },
    {
      "id": "release_negative_charge",
      "category": "Release",
      "type": "daily",
      "name": "Processing Your Emotions",
      "description": "When you found yourself feeling negatively charged (anger, fear, guilt, shame) today, rather than bottle it up (a recipe for trauma to develop and future resentment + fear blocks), how did you release it healthily?",
      "points": 5,
      "inputType": "text",
      "placeholder": "What emotion were you feeling and how did you release it?",
      "learnMore": "Emotions are energy in motion— see them as a song. When we suppress them, it's like clicking pause in the middle of the song. They get stored in the body and create tension, anxiety and if intense enough, trauma.\n\nRelease practices include anything that allow you to experience the emotion and process it so the 'song finishes'. Examples include: running, journaling, breathwork, movement, crying, shaking, screaming (into a pillow), or simply allowing yourself to feel without judgment.\n\nThe goal isn't to 'fix' the emotion but to experience it. Doing any of these practises for 90 seconds is often enough for the emotion to pass through you and the 'song to finish'."
    },
    {
      "id": "release_weekly_big",
      "category": "Release",
      "type": "weekly",
      "name": "Big Release",
      "description": "Complete an extended release whether it be breathwork or another release practise of your choosing",
      "points": 30,
      "inputType": "text",
      "placeholder": "What came up in the session? What did you process and release?",
      "learnMore": "Extended release practices (30+ minutes) allow you to access and clear deeper layers of stored emotion and trauma.\n\nOptions include: conscious-connected breathwork, somatic experiencing, rage rituals, ecstatic dance, or guided emotional release sessions.\n\nThese practices often bring up unexpected emotions—trust the process and let your body lead."
    },
    {
      "id": "rewire_behavior_change",
      "category": "Rewire",
      "type": "daily",
      "name": "Embody Your Essence",
      "description": "What's a moment where you were on auto-pilot and consciously chose to show-up as your essence voice instead?",
      "points": 5,
      "inputType": "text",
      "maxPerDay": 3,
      "placeholder": "What did you do?"
    },
    {
      "id": "rewire_dopamine_diet",
      "category": "Rewire",
      "type": "daily",
      "name": "Dopamine Diet Change",
      "description": "What's a moment where instead of defaulting to 'fast-food' joy, you pursued 'nutritious' joy instead?",
      "points": 3,
      "inputType": "text",
      "placeholder": "What 'fast-food' joy do you usually default to and what was the 'nutritious' joy you chose instead?",
      "learnMore": "Fast-food joy is anything where you feel good in the moment, but leaves you feeling lower after. Think: drinking alcohol, eating high-sugar foods, scrolling social media, watching netflix.\n\nNutritious joy is anything where you suffer but it leaves you feeling better after. Think: purposeful work, going to the gym, vulnerable conversations with friends/family, learning something new.\n\nThe more you choose nutritious joy, the less you'll crave the fast-food hits. You're literally rewiring your brain's reward system."
    },
    {
      "id": "rewire_customer_acquisition",
      "category": "Rewire",
      "type": "daily",
      "name": "Customer Acquisition Task",
      "description": "Take one action toward attracting your ideal audience or customers. Post, reach out, create, or connect.",
      "points": 5,
      "inputType": "text",
      "placeholder": "What action did you take?"
    },
    {
      "id": "milestone_log_conversation",
      "category": "Rewire",
      "type": "daily",
      "name": "Customer Conversation",
      "description": "Have a conversation with someone about your idea/offer. What did you learn?",
      "points": 10,
      "inputType": "conversation_log",
      "placeholder": "Who did you talk to? What was the key insight?",
      "counts_toward_graduation": true,
      "learnMore": "Talking to real people is the fastest way to validate and improve your offer. Each conversation counts toward your stage graduation."
    },
    {
      "id": "rewire_protective_to_essence",
      "category": "Rewire",
      "type": "daily",
      "name": "Protective to Essence Shift",
      "description": "What's a moment where you were showing up as your protective voice but shifted and showed up in your essence?",
      "points": 7,
      "inputType": "text",
      "placeholder": "How did you shift from protective to essence?"
    },
    {
      "id": "rewire_hell_yea",
      "category": "Rewire",
      "type": "daily",
      "name": "Make It A Hell Yea",
      "description": "What event this week flowed into your life that was an immediate \"hell yea\" or what event wasn't a hell yea but you turned into one by changing something about it?",
      "points": 5,
      "inputType": "text",
      "placeholder": "What event this week was a Hell Yea for you?",
      "learnMore": "What's the difference between an A-grade actor and a C-grade actor who started with the same talent? One said yes to any opportunity and found themselves too busy to say yes to the \"hell yea\" ones when they did come and one said yes to only \"Hell Yea\" opportunities which led to more hell yeas.\n\nBy bringing awareness to what a \"hell yea\" is for you also shows what you're interested in and what you want to be doing."
    },
    {
      "id": "milestone_product_created",
      "category": "Rewire",
      "type": "weekly",
      "name": "Product Milestone",
      "description": "Mark a milestone in building your product or offer",
      "points": 25,
      "inputType": "milestone",
      "milestone_type": "product_created",
      "placeholder": "What did you create? Share a link or description.",
      "persona_specific": ["vibe_seeker"],
      "learnMore": "This milestone counts toward your graduation to the Creation stage."
    },
    {
      "id": "milestone_offer_created",
      "category": "Rewire",
      "type": "weekly",
      "name": "Offer Milestone",
      "description": "Mark the completion of your core offer",
      "points": 25,
      "inputType": "milestone",
      "milestone_type": "offer_created",
      "placeholder": "Describe your offer and what makes it valuable.",
      "persona_specific": ["vibe_riser"],
      "learnMore": "This milestone counts toward your graduation to the Testing stage."
    },
    {
      "id": "milestone_model_built",
      "category": "Rewire",
      "type": "weekly",
      "name": "Money Model Milestone",
      "description": "Complete building your money model",
      "points": 25,
      "inputType": "milestone",
      "milestone_type": "model_built",
      "placeholder": "Describe your money model and revenue streams.",
      "persona_specific": ["movement_maker"],
      "learnMore": "This milestone counts toward your graduation to the Testing stage."
    },
    {
      "id": "milestone_tested_with_3",
      "category": "Rewire",
      "type": "weekly",
      "name": "Testing Milestone",
      "description": "Test your product with 3 people",
      "points": 30,
      "inputType": "milestone",
      "milestone_type": "tested_with_3",
      "placeholder": "Who tested it? What feedback did you get?",
      "persona_specific": ["vibe_seeker"],
      "learnMore": "Testing with real users is crucial for validation. This milestone counts toward your stage graduation."
    },
    {
      "id": "milestone_offer_tested_with_3",
      "category": "Rewire",
      "type": "weekly",
      "name": "Offer Testing Milestone",
      "description": "Test your offer with 3 people",
      "points": 30,
      "inputType": "milestone",
      "milestone_type": "offer_tested_with_3",
      "placeholder": "Who tested your offer? What was their response?",
      "persona_specific": ["vibe_riser"],
      "learnMore": "Testing your offer with real potential customers validates market fit. This counts toward your stage graduation."
    },
    {
      "id": "milestone_model_tested_with_3",
      "category": "Rewire",
      "type": "weekly",
      "name": "Model Testing Milestone",
      "description": "Test your model with 3 people",
      "points": 30,
      "inputType": "milestone",
      "milestone_type": "model_tested_with_3",
      "placeholder": "Who tested your model? What insights did you gain?",
      "persona_specific": ["movement_maker"],
      "learnMore": "Testing your money model with real stakeholders validates its viability. This counts toward your stage graduation."
    },
    {
      "id": "milestone_acquisition_offer_launched",
      "category": "Rewire",
      "type": "weekly",
      "name": "Acquisition Offer Launch",
      "description": "Launch your customer acquisition offer",
      "points": 40,
      "inputType": "milestone",
      "milestone_type": "acquisition_offer_launched",
      "placeholder": "Describe your acquisition offer and how you launched it.",
      "persona_specific": ["movement_maker"],
      "learnMore": "Launching your acquisition offer is the key to scaling. This milestone counts toward your stage graduation."
    },
    {
      "id": "groan_skills",
      "category": "Flow Finder",
      "type": "challenge",
      "name": "Groan Challenge: Skills",
      "description": "Do something outside your comfort zone that develops a key skill.",
      "points": 25,
      "inputType": "text",
      "placeholder": "What skill-building groan task did you complete?",
      "learnMore": "A 'groan' is something that you know you can do but terrifies you often due to a fear of judgement. These are tasks that accelerate your growth most.\n\nThe groan indicates you're at an edge. Skill-building groans might include: recording a video, asking for feedback, learning a new tool, or practicing a skill publicly before you feel 'ready.'"
    },
    {
      "id": "groan_persona",
      "category": "Flow Finder",
      "type": "challenge",
      "name": "Groan Challenge: Persona",
      "description": "Do something outside your comfort zone to serve and support your ideal audience",
      "points": 25,
      "inputType": "text",
      "placeholder": "How did you serve your persona this week?",
      "learnMore": "A 'groan' is something that you know you can do but terrifies you often due to a fear of judgement. These are tasks that accelerate your growth most.\n\nThe groan indicates you're at an edge. Persona-building groans might include: hosting a free workshop for a dream client, reaching out to someone you admire to offer value, creating content about something vulnerable, or asking your audience what they need and delivering it."
    },
    {
      "id": "groan_problems",
      "category": "Flow Finder",
      "type": "challenge",
      "name": "Groan Challenge: Problems",
      "description": "Solve a problem you're passionate about for someone in a way that is outside your comfort zone",
      "points": 25,
      "inputType": "text",
      "placeholder": "What problem did you solve?",
      "learnMore": "A 'groan' is something that you know you can do but terrifies you often due to a fear of judgement. These are tasks that accelerate your growth most.\n\nThe groan indicates you're at an edge. Problem-solving groans might include: offering a paid service before you feel qualified, solving a problem publicly (video/article), or approaching someone directly to help them with something they're struggling with."
    },
    {
      "id": "rewire_3_percent_better",
      "category": "Rewire",
      "type": "weekly",
      "name": "3% Better",
      "description": "In your business what can you make 3% better this week?",
      "points": 20,
      "inputType": "text",
      "placeholder": "What did you improve by 3%?",
      "learnMore": "The 3% rule focuses on marginal gains as a recipe for success instead of massive transformation.These small consistent improvements compound exponentially.\n\nInstead of 'I need to completely overhaul my website,' you ask 'What's 3% better?' Maybe it's improving one headline, simplifying your offer, or speeding up your response time. Tiny improvements sustained over time create massive growth."
    },
    {
      "id": "rewire_fear_judgement",
      "category": "Rewire",
      "type": "weekly",
      "name": "Overcoming Fear of Judgement",
      "description": "Rather than expect critical judgement from your actions, expect people will love whatever it is you're doing.",
      "points": 15,
      "inputType": "text",
      "placeholder": "What did you brain default to expecting? What did you change it to?",
      "learnMore": "Anxiety, excitement and nervousness are all the same emotional sensation. What determines what we feel is our expectation of the end result.\n\nIf we expect something bad we feel anxiety. If we expect something good we feel excitement. Nervousness is when we're flip flopping between both.\n\nThe quickest way to overcome fear of judgement anxiety than is to simply change our expectation to be that people will love whatever we're about to do."
    },
    {
      "id": "rewire_fear_not_enough",
      "category": "Rewire",
      "type": "weekly",
      "name": "Overcoming Fear of Not Being Good Enough",
      "description": "What's something this week where the fear of not being good enough crept in and what courage mantra did you tell yourself to overcome that fear?",
      "points": 15,
      "inputType": "text",
      "placeholder": "What was the moment and what was the courage mantra you told yourself?",
      "learnMore": "The quickest way to overcome our fear of not being good enough? Change the story we're telling ourselves. Creating a courage mantra you repeat to yourself is a great way to do this.\n\nCheck out the Healing Compass flow to create this mantra."
    },
    {
      "id": "reconnect_morning_meditation",
      "category": "Reconnect",
      "type": "daily",
      "name": "Meditation",
      "description": "Establish connection with your essence voice and drop into a meditation",
      "points": 5,
      "inputType": "checkbox"
    },
    {
      "id": "reconnect_morning_dance",
      "category": "Reconnect",
      "type": "daily",
      "name": "Rise & Vibe Dance",
      "description": "Play one of your favourite bangers and get your dance on. Rate how you feel out of 10 before and after.",
      "points": 3,
      "inputType": "checkbox"
    },
    {
      "id": "reconnect_morning_breathwork",
      "category": "Reconnect",
      "type": "daily",
      "name": "Breathwork",
      "description": "Complete breathwork and breath life into your essence voice",
      "points": 5,
      "inputType": "checkbox"
    },
    {
      "id": "reconnect_self_identified",
      "category": "Reconnect",
      "type": "daily",
      "name": "Self-Identified Activity",
      "description": "Do something that reconnects you to YOU. Your choice, your ritual, your essence.",
      "points": 3,
      "inputType": "text",
      "placeholder": "What did you do to reconnect today?"
    },
    {
      "id": "reconnect_daily_prayer",
      "category": "Reconnect",
      "type": "daily",
      "name": "Daily Prayer",
      "description": "Pray, share gratitude, set intentions, make asks of whatever greater being you believe is present",
      "points": 4,
      "inputType": "text",
      "placeholder": "What did you pray for or express gratitude about today?",
      "learnMore": "Whether you believe in prayer or not, what I've found is when you do pray and ask for things, every opportunity or serendipity that follows has a sense of magic.\n\nIt leads you to ask \"Is this an answer to my prayer?\". I've found it leads me to remain open to any or all experiences and ensures I don't simply dismiss something prematurely."
    },
    {
      "id": "reconnect_weekly_task",
      "category": "Reconnect",
      "type": "weekly",
      "name": "Weekly Self-Identified Task",
      "description": "Choose a weekly reconnection practice that deeply resonates with you. Make it meaningful.",
      "points": 15,
      "inputType": "text",
      "placeholder": "What was your reconnection practice this week?"
    },
    {
      "id": "reconnect_clothing_ritual",
      "category": "Reconnect",
      "type": "weekly",
      "name": "Clothing Item Ritual",
      "description": "Choose a clothing item your essence voice would love to wear but sparks your fear of judgement",
      "points": 15,
      "inputType": "text",
      "placeholder": "What item did you choose and why?",
      "learnMore": "Your protective voice keeps you small by controlling how you present yourself to the world. Wearing something that feels 'too much' or 'not professional' or 'too bold' is a somatic way to practice being yourself despite fear of judgment. When you dress like your essence, you literally embody it. This is identity work disguised as fashion."
    },
    {
      "id": "reconnect_groan_wheel",
      "category": "Reconnect",
      "type": "weekly",
      "name": "Essence Voice Groan",
      "description": "Do something your Essence Voice would love to do but sparks a fear of judgement, failure or not being good enough",
      "points": 20,
      "inputType": "text",
      "placeholder": "What did you do and how did it go?",
      "learnMore": "Your essence wants to express itself fully, but your protective voice has been blocking it to keep you safe. This quest is about giving your essence permission to play—even if it feels scary. Examples: singing in public, sharing your art, dancing freely, speaking your truth, trying something new without being 'good' at it. The fear is the doorway."
    },
    {
      "id": "reconnect_remove_negative",
      "category": "Reconnect",
      "type": "weekly",
      "name": "Environment Hygiene",
      "description": "Identify and remove yourself from an environment, relationship, or situation that drains your essence.",
      "points": 25,
      "inputType": "text",
      "placeholder": "What negative environment did you address?",
      "learnMore": "When you put hot water and cold water in the same glass, the temperature meets in the middle. Human's are the same, this is why we become the average of our 5 closest friends and why the content we consume shapes our worldview. Sometimes the most impactful thing you can do is remove yourself from spaces, people, or situations that drain your energy or require you to be someone you're not. This might mean unfollowing accounts, leaving a group, setting a boundary with a friend, or quitting a role. Protecting your energy is not selfish—it's essential."
    },
    {
      "id": "reconnect_write_obituary",
      "category": "Reconnect",
      "type": "weekly",
      "name": "Write Your Obituary",
      "description": "Pretend it was your funeral tomorrow, what do you wish your best friend / family said about you in your obituary?",
      "points": 15,
      "inputType": "text",
      "placeholder": "Insert your obituary here",
      "learnMore": "This is a powerful exercise to identify what's really important to you in your life.\n\nI recommend setting a timer for 8 minutes and writing stream of consciousness to start to see what comes up."
    },
    {
      "id": "bonus_feedback",
      "category": "Bonus",
      "type": "anytime",
      "name": "Feedback Form",
      "description": "Share your experience with the challenge. Your feedback helps us improve the journey for everyone.",
      "points": 10,
      "inputType": "flow",
      "flow_id": "feedback",
      "flow_route": "/feedback"
    },
    {
      "id": "bonus_ig_groan",
      "category": "Bonus",
      "type": "anytime",
      "name": "Post Your Groan/s on Instagram",
      "description": "Share one of your 'groan' tasks as a story or post on Instagram. Vulnerability is magnetic. Tag @_Huzz so I can reshare it 🫶🏻",
      "points": 10,
      "inputType": "checkbox"
    },
    {
      "id": "bonus_tell_friend",
      "category": "Bonus",
      "type": "anytime",
      "name": "Tell a Friend",
      "description": "Share this 7-day challenge with someone who you think would love to join.",
      "points": 5,
      "inputType": "checkbox",
      "maxCompletions": 3
    },
    {
      "id": "bonus_essence_ring",
      "category": "Bonus",
      "type": "anytime",
      "name": "Buy Essence Ring",
      "description": "Invest in a physical reminder of your essence voice. Wear your truth. If you can't find one, send Huzz a message.",
      "points": 10,
      "inputType": "checkbox"
    },
    {
      "id": "bonus_challenge_recommendation",
      "category": "Bonus",
      "type": "anytime",
      "name": "Challenge Recommendation",
      "description": "What challenges would you recommend we add to the 7-day challenge? Please let us know are they a weekly or daily challenge and which R (recognise, release, rewire, reconnect) they best support.",
      "points": 10,
      "inputType": "text",
      "placeholder": "Share your challenge recommendations"
    },
    {
      "id": "bonus_elephant_report",
      "category": "Bonus",
      "type": "anytime",
      "name": "Weekly Reflection",
      "description": "Out of 10 how would you rate the 7-day challenge? You're not allowed to give it a 7. Also include what made you give it that score.",
      "points": 10,
      "inputType": "text",
      "placeholder": "Your rating (0-10, not 7) and what made you give it that score"
    },
    {
      "id": "flow_finder_skills",
      "category": "Flow Finder",
      "type": "flow",
      "name": "Flow Finder: Skills",
      "description": "Discover your unique skills and what you're naturally great at",
      "points": 30,
      "inputType": "flow",
      "flow_id": "nikigai_skills",
      "flow_route": "/nikigai/skills",
      "persona_specific": ["vibe_seeker"],
      "stage_required": "clarity",
      "learnMore": "This flow helps you identify your natural talents and acquired skills. These form one pillar of your unique opportunities."
    },
    {
      "id": "flow_finder_problems",
      "category": "Flow Finder",
      "type": "flow",
      "name": "Flow Finder: Problems",
      "description": "Identify the problems you're passionate about solving",
      "points": 30,
      "inputType": "flow",
      "flow_id": "nikigai_problems",
      "flow_route": "/nikigai/problems",
      "persona_specific": ["vibe_seeker"],
      "stage_required": "clarity",
      "learnMore": "Discover which problems energize you to solve. These become the foundation of your impact."
    },
    {
      "id": "flow_finder_persona",
      "category": "Flow Finder",
      "type": "flow",
      "name": "Flow Finder: Personas",
      "description": "Discover who you're meant to serve and support",
      "points": 30,
      "inputType": "flow",
      "flow_id": "nikigai_persona",
      "flow_route": "/nikigai/persona",
      "persona_specific": ["vibe_seeker"],
      "stage_required": "clarity",
      "learnMore": "Identify the people and communities you naturally connect with and want to serve."
    },
    {
      "id": "flow_finder_integration",
      "category": "Flow Finder",
      "type": "flow",
      "name": "Putting It All Together",
      "description": "Integrate your skills, problems, and personas into unique opportunities",
      "points": 40,
      "inputType": "flow",
      "flow_id": "nikigai_integration",
      "flow_route": "/nikigai/integration",
      "persona_specific": ["vibe_seeker"],
      "stage_required": "clarity",
      "learnMore": "Combine everything you've discovered to reveal concrete opportunities aligned with your flow."
    },
    {
      "id": "flow_100m_offer",
      "category": "Flow Finder",
      "type": "flow",
      "name": "$100M Offer Flow",
      "description": "Design an irresistible offer using Alex Hormozi's framework",
      "points": 35,
      "inputType": "flow",
      "flow_id": "100m_offer",
      "flow_route": "/100m-offer",
      "persona_specific": ["vibe_riser"],
      "stage_required": "creation",
      "learnMore": "Create a compelling offer that solves a specific problem for your ideal customer."
    },
    {
      "id": "flow_lead_magnet",
      "category": "Flow Finder",
      "type": "flow",
      "name": "Lead Magnet Flow",
      "description": "Create a lead magnet to attract your ideal customers",
      "points": 30,
      "inputType": "flow",
      "flow_id": "lead_magnet_offer",
      "flow_route": "/lead-magnet",
      "persona_specific": ["vibe_riser"],
      "stage_required": "creation",
      "learnMore": "Design a valuable free resource that builds trust and grows your audience."
    },
    {
      "id": "flow_100m_leads",
      "category": "Flow Finder",
      "type": "flow",
      "name": "$100M Leads Flow",
      "description": "Build your customer acquisition strategy",
      "points": 40,
      "inputType": "flow",
      "flow_id": "100m_leads",
      "flow_route": "/leads-strategy",
      "persona_specific": ["vibe_riser", "movement_maker"],
      "stage_required": "launch",
      "learnMore": "Define your complete strategy for attracting and converting customers."
    },
    {
      "id": "flow_attraction_offer",
      "category": "Flow Finder",
      "type": "flow",
      "name": "Attraction Offer Flow",
      "description": "Design your customer acquisition offer",
      "points": 35,
      "inputType": "flow",
      "flow_id": "attraction_offer",
      "flow_route": "/attraction-offer",
      "persona_specific": ["movement_maker"],
      "stage_required": "ideation",
      "learnMore": "Create the offer that brings new customers into your ecosystem."
    },
    {
      "id": "flow_upsell",
      "category": "Flow Finder",
      "type": "flow",
      "name": "Upsell Flow",
      "description": "Design your upsell offer to increase customer value",
      "points": 30,
      "inputType": "flow",
      "flow_id": "upsell_flow",
      "flow_route": "/upsell-offer",
      "persona_specific": ["movement_maker"],
      "stage_required": "ideation",
      "learnMore": "Create a premium offer that provides additional value to engaged customers."
    },
    {
      "id": "flow_downsell",
      "category": "Flow Finder",
      "type": "flow",
      "name": "Downsell Flow",
      "description": "Design your downsell offer for budget-conscious customers",
      "points": 30,
      "inputType": "flow",
      "flow_id": "downsell_flow",
      "flow_route": "/downsell-offer",
      "persona_specific": ["movement_maker"],
      "stage_required": "ideation",
      "learnMore": "Create an accessible offer that serves customers who aren't ready for your main offer."
    },
    {
      "id": "flow_continuity",
      "category": "Flow Finder",
      "type": "flow",
      "name": "Continuity Flow",
      "description": "Design your recurring revenue model",
      "points": 35,
      "inputType": "flow",
      "flow_id": "continuity_flow",
      "flow_route": "/continuity-offer",
      "persona_specific": ["movement_maker"],
      "stage_required": "ideation",
      "learnMore": "Create a subscription or membership model for ongoing customer relationships."
    }
  ],
  "artifacts": [
    {
      "id": "treasure_map",
      "name": "Treasure Map",
      "category": "Recognise",
      "description": "Identify where to find your flow.",
      "weeklyPointsRequired": 70,
      "dailyPointsRequired": 90,
      "totalRequired": 160,
      "image": "/images/artifacts/treasure-map.png"
    },
    {
      "id": "cutting_anchor",
      "name": "Cutting The Anchor",
      "category": "Release",
      "description": "Letting go of what's stopping your flow.",
      "weeklyPointsRequired": 30,
      "dailyPointsRequired": 54,
      "totalRequired": 84,
      "image": "/images/artifacts/cutting-anchor.png"
    },
    {
      "id": "captains_hat",
      "name": "Captain's Hat",
      "category": "Rewire",
      "description": "Taking action to be who you were born to be.",
      "weeklyPointsRequired": 100,
      "dailyPointsRequired": 113,
      "totalRequired": 213,
      "image": "/images/artifacts/captains-hat.png"
    },
    {
      "id": "essence_boat",
      "name": "Essence Boat",
      "category": "Reconnect",
      "description": "Your Vessel for living your flow.",
      "weeklyPointsRequired": 70,
      "dailyPointsRequired": 90,
      "totalRequired": 160,
      "image": "/images/artifacts/essence-boat.png"
    }
  ]
}
